# InstallScriptAddPath

## Description
This function can only be used doring Partner Product install script to add files, by full path, to the install memento for automatic deletion during uninstall.

```pascal
PROCEDURE InstallScriptAddPath(fullPath : DYNARRAY[] of CHAR);
```

```python
def vs.InstallScriptAddPath(fullPath):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fullPath|DYNARRAY[] of CHAR|   |

## Version
Availability: from Vectorworks 2021

## Category
* Utility